OdUnitsFormatter.unformatA(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified string as an angular value.
\param string [in]  String to unformat.
\remarks
All angles are expressed as radians.

OdUnitsFormatter.formatA(System.Double,OdUnitsFormatter.AUnits,System.Int32,System.Int32,System.Int32,System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Returns the specified angular value as a string.
\param value [in]  Value to format.
\param aUnits [in]  Angle units.
\param precision [in]  Number of decimal places.
\param dimzin [in]  A combination of ZeroSuppressionFlags.
\param unitMode [in]  UNITMODE value.
\param decsep [in]  Decimal separator.
\remarks
* A zero value for decsep specifies the default separator is to be used.
\remarks
All angles are expressed as radians.

OdUnitsFormatter.formatL(System.Double,OdUnitsFormatter.LUnits,System.Int32,System.Int32,System.Int32,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Returns the specified distance value as a string.
\param value [in]  Value to format.
\param lUnits [in]  Length units.
\param precision [in]  Number of decimal places.
\param dimzin [in]  A combination of ZeroSuppressionFlags.
\param unitMode [in]  UNITMODE value.
\param decsep [in]  Decimal separator.
\param thsep [in]  Thousands separator.
\remarks
* A zero value for decsep specifies the default seoarator is to be used.
* A zero value for thsep specifies that no separator is to be used.

OdUnitsFormatter.formatAngle(System.Double)
\details
Returns the specified angle value as a string.
\param value [in]  Value to format.
\remarks
The returned value depends on the ANGBASE, AUNITS, AUPREC, DIMZIN, and UNITMODE system variables.
\remarks
All angles are expressed in radians.